VanillaCo1a/Single-phase_AC_electronic_load/Firmware/STM32_Ctrl/CodeMultiPlatform/device/device.c
#include "device.h"
#include "timer.h"

/////////////////////////    设备流控制部分    /////////////////////////
static poolsize _devSize = 0;
static DEV_TypeDef *_devPool[DEVPOOL_MAXNUM] = {0};
static uint64_t _devBusyList[DEVBUSYLIST_MAXNUM] = {0};    //忙设备表, 0为空, 非0为设备置忙时刻(us)

static DEVS_TypeDef *_actDevs = NULL;
static DEV_TypeDef *_actDev = NULL;
static DEVIO_TypeDef *_actDevIo = NULL;
static DEVCMNI_TypeDef *_actDevCmni = NULL;
/**
 * @description: 活动设备类设置: 设置活动设备类, 设备流根据活动设备类切换
 * @param {DEVS_TypeDef} *self
 * @return {*}
 */
int8_t DEV_setActDevs(DEVS_TypeDef *self) {
    if(self == NULL) {
        return 1;
    }
    _actDevs = self;
    _actDev = _devPool[self->pool + self->stream];
    _actDevIo = _actDev->io.confi;
    _actDevCmni = _actDev->cmni.confi;
    return 0;
}
/**
 * @description: 活动设备类获取: 获取当前活动设备类
 * @param {*}
 * @return {*}_actDevs
 */
DEVS_TypeDef *DEV_getActDevs(void) {
    return _actDevs;
}
/**
 * @description: 活动设备流设置: 设置活动设备类和设备流
 * @param {DEVS_TypeDef} *self
 * @param {poolsize} stream
 * @return {*}
 */
int8_t DEV_setActStream(DEVS_TypeDef *self, poolsize stream) {
    if(self == NULL || stream > _devSize || stream > self->size) {
        return 1;
    }
    self->stream = stream;
    _actDevs = self;
    _actDev = _devPool[self->pool + self->stream];
    _actDevIo = _devPool[self->pool + self->stream]->io.confi;
    _actDevCmni = _devPool[self->pool + self->stream]->cmni.confi;
    return 0;
}
/**
 * @description: 活动设备流获取: 获取当前活动设备类的设备流
 * @param {*}
 * @return {*}_actDevs->stream
 */
inline poolsize DEV_getActStream(void) {
    return _actDevs->stream;
}
/**
 * @description: 活动设备相关句柄获取
 * @param {*}
 * @return {*}
 */
inline DEV_TypeDef *DEV_getActDev(void) {
    return _actDev;
}
inline DEVIO_TypeDef *DEV_getActDevIo(void) {
    return _actDevIo;
}
inline DEVCMNI_TypeDef *DEV_getActDevCmni(void) {
    return _actDevCmni;
}
inline DEVCMNIIO_TypeDef *DEV_getActDevCmniIo(void) {
    return (DEVCMNIIO_TypeDef *)_actDevIo;
}
/**
 * @description: 关闭活动设备流
 * @param {*}
 * @return {*}
 */
void DEV_closeActStream(void) {
    _actDev = NULL;
    _actDevs = NULL;
    _actDevIo = NULL;
    _actDevCmni = NULL;
}
/**
 * @description: 设备流设置: 设置某设备类的设备流
 * @param {DEVS_TypeDef} *self
 * @param {poolsize} stream
 * @return {*}
 */
int8_t DEV_setStream(DEVS_TypeDef *self, poolsize stream) {
    if(self == NULL || stream > _devSize || stream > self->size) {
        return 1;
    }
    self->stream = stream;
    return 0;
}
/**
 * @description: 设备流获取: 获取某设备类的设备流
 * @param {DEVS_TypeDef} *self
 * @return {*}
 */
DEV_TypeDef *DEV_getStream(DEVS_TypeDef *self) {
    if(self == NULL) {
        return NULL;
    }
    return _devPool[self->pool + self->stream];
}
/**
 * @description: 设置活动设备类设备的状态, us>0设置设备忙时长(单位为20us),us=0设置设备闲
 * @param {DEVS_TypeDef} *self
 * @param {uint16_t} twus
 * @return {*}
 */
int8_t DEV_setActState(uint16_t twus) {
    if(twus > 0 && _actDev->state == 0) {                     //设置设备状态为忙
        for(poolsize i = 0; i < DEVBUSYLIST_MAXNUM; i++) {    //遍历设备表寻找空位
            if(_devBusyList[i] == 0) {
                _actDev->state = i + 1;    //设置成功, 保存当前设备忙时间记录在忙设备列表的第几个
                _devBusyList[i] = TIMER_getRunTimeus() + twus * 20;
                break;
            }
        }
        if(_actDev->state == 0) {
            return 1;    //设备状态表已满, 设置设备忙失败
        }
    } else if(twus > 0 && _actDev->state > 0) {    //更新设备置忙时间
        _devBusyList[_actDev->state - 1] = TIMER_getRunTimeus() + twus * 20;
    } else if(twus == 0 && _actDev->state > 0) {    //设置设备状态为闲
        _devBusyList[_actDev->state - 1] = 0;
        _actDev->state = 0;
    }
    return 0;
}
/**
 * @description: 获取设备类设备的状态, 先查询忙设备是否满足空闲条件, 然后更新状态并返回
 * @param {DEVS_TypeDef} *self
 * @return {*}
 */
DEV_StateTypeDef DEV_getActState(void) {
    if(_actDev->state > 0 && TIMER_getRunTimeus() > _devBusyList[_actDev->state - 1]) {
        _devBusyList[_actDev->state - 1] = 0;    //设备忙指定时间后转为空闲状态
        _actDev->state = 0;
    }
    return _actDev->state == 0 ? idle : busy;
}
bool DEV_isNull(DEV_TypeDef *dev) {
    if(dev == NULL || dev == NULL) {
        return true;
    }
    return false;
}
bool DEVS_isNull(DEVS_TypeDef *devs, DEV_TypeDef dev[]) {
    if(devs == NULL) {
        return true;
    }
    for(poolsize i = 0; i < devs->size; i++) {
        if(DEV_isNull(&dev[i])) {
            return true;
        }
    }
    return false;
}
/**
 * @description: 初始化一个设备类, 从设备池中分配空闲指针指向设备数组, 并将序号更新至设备类句柄中
 * @param {DEVS_TypeDef} *devs
 * @param {DEV_TypeDef} dev
 * @param {poolsize} num
 * @return {*}
 */
bool DEVPOOL_init(DEVS_TypeDef *devs, DEV_TypeDef dev[], poolsize num) {
    if(devs->type == DEVUNDEF || _devSize + num >= DEVPOOL_MAXNUM) {
        return true;    //申请失败
    }
    devs->stream = 0;
    devs->pool = _devSize;
    devs->size += num;
    _devSize += num;
    for(poolsize i = 0; i < num; i++) {
        dev[i].state = 0;
        dev[i].error = 0;
        _devPool[devs->pool + i] = &dev[i];
    }
    return false;
}
/**
 * @description: 对某一设备类批量进行某一操作
 * @param {DEVS_TypeDef} *devs
 * @param {void(*)()} *action
 * @return {*}
 */
void DEV_doAction(DEVS_TypeDef *devs, void (*action)(void)) {
    for(poolsize i = 0; i < devs->size; i++) {
        DEV_setActStream(devs, i);
        action();
    }
    DEV_closeActStream();
}


/////////////////////////    设备IO部分    /////////////////////////
inline bool DEVIO_isNull(DEVIO_TypeDef *devio) {
    //todo: 模仿hal库, 改为使用assert_param进行有效性判断
#if defined(STM32)
    if(devio->GPIOx == NULL) {
        return true;
    }
#if defined(USE_LLLIB) && defined(USE_FULL_LL_DRIVER)
    if(devio->GPIO_Pin == (uint16_t)0x0000) {
        return true;
    }
#else
    if(devio->GPIO_Pin == (uint32_t)0x00000000) {
        return true;
    }
#endif
#endif
    return false;
}
void DEVIO_Init(DEVIO_TypeDef *devio) {
    /* devio Clock Init */
#if defined(STM32)
#if defined(STM32HAL)
    if(devio->GPIOx == GPIOA) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    } else if(devio->GPIOx == GPIOB) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    } else if(devio->GPIOx == GPIOC) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
#if defined(GPIOD)
    else if(devio->GPIOx == GPIOD) {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    }
#endif /* GPIOD */
#if defined(GPIOE)
    else if(devio->GPIOx == GPIOE) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    }
#endif /* GPIOE */
#if defined(GPIOF)
    else if(devio->GPIOx == GPIOF) {
        __HAL_RCC_GPIOF_CLK_ENABLE();
    }
#endif /* GPIOF */
#if defined(GPIOG)
    else if(devio->GPIOx == GPIOG) {
        __HAL_RCC_GPIOG_CLK_ENABLE();
    }
#endif /* GPIOG */
#if defined(GPIOH)
    else if(devio->GPIOx == GPIOH) {
        __HAL_RCC_GPIOH_CLK_ENABLE();
    }
#endif /* GPIOH */
#if defined(GPIOI)
    else if(devio->GPIOx == GPIOI) {
        __HAL_RCC_GPIOI_CLK_ENABLE();
    }
#endif /* GPIOI */
#if defined(GPIOJ)
    else if(devio->GPIOx == GPIOJ) {
        __HAL_RCC_GPIOJ_CLK_ENABLE();
    }
#endif /* GPIOJ */
#if defined(GPIOK)
    else if(devio->GPIOx == GPIOK) {
        __HAL_RCC_GPIOK_CLK_ENABLE();
    }
#endif /* GPIOK */
#elif defined(STM32FWLIB)
    RCC_APB2PeriphClockCmd(devio->CLK, ENABLE);
#endif
    /* GPIO Pin Set */
    DEVIO_WritePin(devio, devio->Init.State);
    /* GPIO Mode Configure */
#if defined(STM32HAL)
    devio->Init.Structure.Pin = devio->GPIO_Pin;
    HAL_GPIO_Init(devio->GPIOx, &devio->Init.Structure);
#else
    devio->Init.Structure.GPIO_Pin = devio->GPIO_Pin;
    GPIO_Init(devio->GPIOx, &devio->Init.Structure);
#endif
#endif
}

