VanillaCo1a/Single-phase_AC_electronic_load/Firmware/STM32_Ctrl/CodeMultiPlatform/device/device.c
inline void DEVIO_SetPin(DEVIO_TypeDef *devio) {
#if defined(STM32)
#if defined(STM32HAL)
#if defined(USE_LLLIB) && defined(USE_FULL_LL_DRIVER)
    LL_GPIO_SetOutputPin(devio->GPIOx, devio->GPIO_Pin);
#elif defined(USE_REGISTER)
    devio->GPIOx->BSRR = devio->GPIO_Pin;
#else
    HAL_GPIO_WritePin(devio->GPIOx, devio->GPIO_Pin, GPIO_PIN_SET);
#endif
#elif defined(STM32FWLIB)
#if defined(USE_REGISTER)
    devio->GPIOx->BSRR = devio->GPIO_Pin;
#else
    GPIO_SetBits(devio->GPIOx, devio->GPIO_Pin);
#endif
#endif
#endif
}
inline void DEVIO_ResetPin(DEVIO_TypeDef *devio) {
#if defined(STM32)
#if defined(STM32HAL)
#if defined(USE_LLLIB) && defined(USE_FULL_LL_DRIVER)
    LL_GPIO_ResetOutputPin(devio->GPIOx, devio->GPIO_Pin);
#elif defined(USE_REGISTER)
    devio->GPIOx->BSRR = (uint32_t)devio->GPIO_Pin << 16U;
#else
    HAL_GPIO_WritePin(devio->GPIOx, devio->GPIO_Pin, GPIO_PIN_RESET);
#endif
#elif defined(STM32FWLIB)
#if defined(USE_REGISTER)
    devio->GPIOx->BSRR = (uint32_t)devio->GPIO_Pin << 16U;
#else
    GPIO_ResetBits(devio->GPIOx, devio->GPIO_Pin);
#endif
#endif
#endif
}
inline void DEVIO_WritePin(DEVIO_TypeDef *devio, DEVIO_PinState pinstate) {
#if defined(STM32)
#if defined(STM32HAL)
#if defined(USE_LLLIB) && defined(USE_FULL_LL_DRIVER)
    if(pinstate != DEVIO_PIN_RESET)
        LL_GPIO_SetOutputPin(devio->GPIOx, devio->GPIO_Pin);
    else
        LL_GPIO_ResetOutputPin(devio->GPIOx, devio->GPIO_Pin);
#elif defined(USE_REGISTER)
    devio->GPIOx->BSRR = (uint32_t)devio->GPIO_Pin << (!pinstate << 4);
    //#define BitBand(Addr, Bit) *((volatile int *)(((int)(Addr)&0x60000000) + 0x02000000 + (int)(Addr)*0x20 + (Bit)*4))
    //BitBand(&devio->GPIOx->ODR, pinstate == OLED0_SCK_Pin ? 13 : 15) = pinstate;
#else
    HAL_GPIO_WritePin(devio->GPIOx, devio->GPIO_Pin, (GPIO_PinState)pinstate);
#endif
#elif defined(STM32FWLIB)
#if defined(USE_REGISTER)
    devio->GPIOx->BSRR = (uint32_t)devio->GPIO_Pin << (!pinstate << 4);
#else
    if(pinstate != DEVIO_PIN_RESET)
        GPIO_SetBits(devio->GPIOx, devio->GPIO_Pin);
    else
        GPIO_ResetBits(devio->GPIOx, devio->GPIO_Pin);
#endif
#endif
#endif
}
inline DEVIO_PinState DEVIO_ReadPin(DEVIO_TypeDef *devio) {
#if defined(STM32)
#if defined(STM32HAL)
#if defined(USE_LLLIB) && defined(USE_FULL_LL_DRIVER)
    return (DEVIO_PinState)LL_GPIO_IsInputPinSet(devio->GPIOx, devio->GPIO_Pin);
#elif defined(USE_REGISTER)
    return (DEVIO_PinState)((devio->GPIOx->IDR & devio->GPIO_Pin) == devio->GPIO_Pin);
#else
    return (DEVIO_PinState)HAL_GPIO_ReadPin(devio->GPIOx, devio->GPIO_Pin);
#endif
#elif defined(STM32FWLIB)
#if defined(USE_REGISTER)
    return (DEVIO_PinState)((devio->GPIOx->IDR & devio->GPIO_Pin) == devio->GPIO_Pin);
#else
    return (DEVIO_PinState)GPIO_ReadInputDataBit(devio->GPIOx, devio->GPIO_Pin);
#endif
#endif
#endif
}


/////////////////////////    设备通信部分    /////////////////////////
//    模拟通信的方法绑定
__inline void DEVCMNI_SCL_Set(bool dir) {}
__inline void DEVCMNI_SDA_OWRE_Set(bool dir) {}
__inline void DEVCMNI_SCL_SCK_Out(bool pot) {
    DEVIO_WritePin(&DEV_getActDevCmniIo()->SCL_SCK, (DEVIO_PinState)pot);
}
__inline void DEVCMNI_SDA_SDI_OWRE_Out(bool pot) {
    DEVIO_WritePin(&DEV_getActDevCmniIo()->SDA_SDI_OWRE, (DEVIO_PinState)pot);
}
__inline bool DEVCMNI_SCL_In(void) {
    return DEVIO_ReadPin(&DEV_getActDevCmniIo()->SCL_SCK);
}
__inline bool DEVCMNI_SDA_OWRE_In(void) {
    return DEVIO_ReadPin(&DEV_getActDevCmniIo()->SDA_SDI_OWRE);
}
__inline bool DEVCMNI_SDO_In(void) {
    return DEVIO_ReadPin(&DEV_getActDevCmniIo()->SDO);
}
__inline void DEVCMNI_CS_Out(bool pot) {
    DEVIO_WritePin(&DEV_getActDevCmniIo()->CS, (DEVIO_PinState)pot);
}
void DEVCMNI_Error(int8_t err) {
    DEV_Error(_actDevs->type << 8 | err);
}
void DEVCMNI_Delayus(uint64_t us) {
    if(us) {
#if defined(STM32)
#if defined(STM32HAL)
        delayus_timer(us);
#elif defined(STM32FWLIB)
        delayus_timer(us);
#endif
#endif
    }
}
void DEVCMNI_Delayms(uint64_t ms) {
    if(ms) {
#if defined(STM32)
#if defined(STM32HAL)
#ifdef __TIMER_H
        delayms_timer(ms);
#else
        HAL_Delay(ms);
#endif
#elif defined(STM32FWLIB)
        delayms_timer(ms);
#endif
#endif
    }
}
int8_t DEVCMNI_Delayus_paral(uint64_t us) {
    if(us) {
#if defined(STM32)
#if defined(STM32HAL)
        return delayus_timer_paral(us);
#elif defined(STM32FWLIB)
        return delayus_timer_paral(us);
#endif
#endif
    }
    return 1;
}

bool DEVCMNI_isNull(DEVCMNI_TypeDef *devcmni) {
    if(devcmni->protocol == 0 || devcmni->ware == 0) {    //若设备通信配置未正确配置, 则返回
        return true;
    }
    if(devcmni->modular == NULL) {    //若设备句柄为空, 则返回
        return true;
    }
    return false;
}
bool DEVCMNIBUS_isNull(DEVCMNI_TypeDef *devcmni) {
    if(devcmni->bus == NULL) {    //若总线句柄两处均为空, 则返回
        if(devcmni->protocol == I2C) {
            if(((I2C_ModuleHandleTypeDef *)devcmni->modular)->bus == NULL) {
                return true;
            }
        } else if(devcmni->protocol == SPI) {
            if(((SPI_ModuleHandleTypeDef *)devcmni->modular)->bus == NULL) {
                return true;
            }
        } else if(devcmni->protocol == ONEWIRE) {
            if(((ONEWIRE_ModuleHandleTypeDef *)devcmni->modular)->bus == NULL) {
                return true;
            }
        } else if(devcmni->protocol == USART) {
            if(((UART_ModuleHandleTypeDef *)devcmni->modular)->bus == NULL) {
                return true;
            }
        }
    }

    return false;
}
bool DEVCMNIIO_isNull(DEVCMNI_TypeDef *devcmni, DEVCMNIIO_TypeDef *devcmniio) {
    if(devcmni->protocol == I2C) {
        if(DEVIO_isNull(&devcmniio->SCL_SCK) || DEVIO_isNull(&devcmniio->SDA_SDI_OWRE)) {
            return true;
        }
    } else if(devcmni->protocol == SPI) {
        if(DEVIO_isNull(&devcmniio->SCL_SCK) || (DEVIO_isNull(&devcmniio->SDA_SDI_OWRE) && DEVIO_isNull(&devcmniio->SDO))) {
            return true;
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(DEVIO_isNull(&devcmniio->SDA_SDI_OWRE)) {
            return true;
        }
    }
    return false;
}
//    I2C/SPI/ONEWIRE通信总线初始化函数
void DEVCMNI_BusInit(DEVCMNI_TypeDef *devcmni) {
    if(devcmni->protocol == I2C) {
        I2C_ModuleHandleTypeDef *devmdlr = devcmni->modular;
        devmdlr->bus = devcmni->bus;
        devcmni->bus = NULL;
        if(devcmni->ware == SOFTWARE) {
#ifdef I2C_USEPOINTER
            I2C_SoftHandleTypeDef *devbus = devmdlr->bus;
            devbus->SCL_Set = DEVCMNI_SCL_Set;
            devbus->SDA_Set = DEVCMNI_SDA_OWRE_Set;
            devbus->SCL_Out = DEVCMNI_SCL_SCK_Out;
            devbus->SDA_Out = DEVCMNI_SDA_SDI_OWRE_Out;
            devbus->SCL_In = DEVCMNI_SCL_In;
            devbus->SDA_In = DEVCMNI_SDA_OWRE_In;
            devbus->error = DEVCMNI_Error;
            devbus->delayus = DEVCMNI_Delayus;
            devbus->delayms = DEVCMNI_Delayms;
            devbus->delayus_paral = DEVCMNI_Delayus_paral;
#endif
        }
    } else if(devcmni->protocol == SPI) {
        SPI_ModuleHandleTypeDef *devmdlr = devcmni->modular;
        devmdlr->bus = devcmni->bus;
        devcmni->bus = NULL;
        if(devcmni->ware == SOFTWARE) {
#ifdef SPI_USEPOINTER
            SPI_SoftHandleTypeDef *devbus = devmdlr->bus;
            devbus->SCK_Out = DEVCMNI_SCL_SCK_Out;
            devbus->SDI_Out = DEVCMNI_SDA_SDI_OWRE_Out;
            devbus->CS_Out = DEVCMNI_CS_Out;
            devbus->error = DEVCMNI_Error;
            devbus->delayus = DEVCMNI_Delayus;
            devbus->delayms = DEVCMNI_Delayms;
            devbus->delayus_paral = DEVCMNI_Delayus_paral;
#endif
        }
    } else if(devcmni->protocol == ONEWIRE) {
        ONEWIRE_ModuleHandleTypeDef *devmdlr = devcmni->modular;
        devmdlr->bus = devcmni->bus;
        devcmni->bus = NULL;
        if(devcmni->ware == SOFTWARE) {
#ifdef OWRE_USEPOINTER
            ONEWIRE_SoftHandleTypeDef *devbus = devmdlr->bus;
            devbus->OWIO_Set = DEVCMNI_SDA_OWRE_Set;
            devbus->OWIO_Out = DEVCMNI_SDA_SDI_OWRE_Out;
            devbus->OWIO_In = DEVCMNI_SDA_OWRE_In;
            devbus->error = DEVCMNI_Error;
            devbus->delayus = DEVCMNI_Delayus;
            devbus->delayms = DEVCMNI_Delayms;
            devbus->delayus_paral = DEVCMNI_Delayus_paral;
#endif
        }
    } else if(devcmni->protocol == USART) {
        UART_ModuleHandleTypeDef *devmdlr = devcmni->modular;
        devmdlr->bus = devcmni->bus;
        devcmni->bus = NULL;
    }
}
//    I2C/SPI/ONEWIRE通信设备初始化函数
void DEVCMNI_Init(DEVCMNI_TypeDef *devcmni, DEVCMNIIO_TypeDef *devcmniio) {
    //不同设备实际使用的通信引脚不同, 未定义的引脚不会被初始化
#if defined(STM32HAL)
    //HAL库的初始化可由CubeMX在main函数中完成, 此处会再次对通信的引脚进行初始化
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    if(devcmni->protocol == I2C) {
        I2C_ModuleHandleTypeDef *devmodular = devcmni->modular;
        if(devcmni->ware == SOFTWARE) {
            if(devmodular->speed >= DEVI2C_ULTRAFAST) {
                GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
                GPIO_InitStructure.Pull = GPIO_NOPULL;
                GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
            } else {
                GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_OD;
                GPIO_InitStructure.Pull = GPIO_PULLUP;
                GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
            }
            devcmniio->SCL_SCK.Init.Structure = GPIO_InitStructure;
            devcmniio->SCL_SCK.Init.State = DEVIO_PIN_SET;
            devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
            devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SCL_SCK);         //初始化SCL
            DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化SDA
        } else if(devcmni->ware == HARDWARE) {
            //hal库的硬件I2C初始化,待补充
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
            GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
            GPIO_InitStructure.Pull = GPIO_NOPULL;
            GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
            devcmniio->SCL_SCK.Init.Structure = GPIO_InitStructure;
            devcmniio->SCL_SCK.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SCL_SCK);    //初始化SCK
            if(!DEVIO_isNull(&devcmniio->SDA_SDI_OWRE)) {
                devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
                devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化SDI
            }
            if(!DEVIO_isNull(&devcmniio->SDO)) {
                GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_OD;
                GPIO_InitStructure.Pull = GPIO_PULLUP;
                GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                devcmniio->SDO.Init.Structure = GPIO_InitStructure;
                devcmniio->SDO.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->SDO);    //初始化SDO
            }
            if(!DEVIO_isNull(&devcmniio->CS)) {
                GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
                GPIO_InitStructure.Pull = GPIO_NOPULL;
                GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;
                devcmniio->CS.Init.Structure = GPIO_InitStructure;
                devcmniio->CS.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->CS);    //初始化CS
            }
        } else if(devcmni->ware == HARDWARE) {
            //hal库的硬件SPI初始化,待补充
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
            GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_OD;
            GPIO_InitStructure.Pull = GPIO_PULLUP;
            GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
            devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
            devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化OWIO
        }
    } else if(devcmni->protocol == USART) {
        //...
    }
#elif defined(STM32FWLIB)
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    if(devcmni->protocol == I2C) {
        if(devcmni->ware == SOFTWARE) {
            I2C_ModuleHandleTypeDef *i2cdev = devcmni->modular;
            if(i2cdev->speed >= DEVI2C_ULTRAFAST) {
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            } else {
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            }
            devcmniio->SCL_SCK.Init.Structure = GPIO_InitStructure;
            devcmniio->SCL_SCK.Init.State = DEVIO_PIN_SET;
            devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
            devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SCL_SCK);         //初始化SCL
            DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化SDA
        } else if(devcmni->ware == HARDWARE) {
            //固件库的硬件I2C初始化,待补充
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            devcmniio->SCL_SCK.Init.Structure = GPIO_InitStructure;
            devcmniio->SCL_SCK.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SCL_SCK);    //初始化SCK
            if(!DEVIO_isNull(&devcmniio->SDA_SDI_OWRE)) {
                devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
                devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化SDI
            }
            if(!DEVIO_isNull(&devcmniio->SDO)) {
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
                devcmniio->SDO.Init.Structure = GPIO_InitStructure;
                devcmniio->SDO.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->SDO);    //初始化SDO
            }
            if(!DEVIO_isNull(&devcmniio->CS)) {
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
                devcmniio->CS.Init.Structure = GPIO_InitStructure;
                devcmniio->CS.Init.State = DEVIO_PIN_SET;
                DEVIO_Init(&devcmniio->CS);    //初始化CS
            }
        } else if(devcmni->ware == HARDWARE) {
            //固件库的硬件SPI初始化,待补充
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            devcmniio->SDA_SDI_OWRE.Init.Structure = GPIO_InitStructure;
            devcmniio->SDA_SDI_OWRE.Init.State = DEVIO_PIN_SET;
            DEVIO_Init(&devcmniio->SDA_SDI_OWRE);    //初始化OWIO
        }
    } else if(devcmni->protocol == USART) {
        //...
    }
#endif
}
//    I2C/SPI/ONEWIRE通信驱动函数
bool DEVCMNI_ReadBit(uint8_t address) {
    bool bit = 0;
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    void *handle = devcmni->modular;
    if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVOWRE_SOFTWARE_ENABLED)
            DEVONEWIRE_ReadBit((ONEWIRE_ModuleHandleTypeDef *)handle, &bit);
#endif    // DEVOWRE_SOFTWARE_ENABLED
        }
    }
    return bit;
}
uint8_t DEVCMNI_ReadByte(uint8_t address) {
    uint8_t byte = 0;
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = &DEV_getActDevCmniIo()[_actDev->cmni.numnow];
    void *handle = devcmni->modular;
    if(devcmni->protocol == I2C) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVI2C_SOFTWARE_ENABLED)
            DEVI2C_Transmit((I2C_ModuleHandleTypeDef *)handle, &byte, 1, address, 1, 0x10);
#endif    // DEVI2C_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVI2C_HARDWARE_ENABLED)
            DEVI2C_Transmit_H((I2C_ModuleHandleTypeDef *)handle, &byte, 1, address, 1, 0x10);
#endif    // DEVI2C_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVSPI_SOFTWARE_ENABLED)
            DEVSPI_Transmit((SPI_ModuleHandleTypeDef *)handle, &byte, 1, 1, 0x10);
#endif    // DEVSPI_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVSPI_HARDWARE_ENABLED)
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_ResetPin(&devio->CS);
                }
            }
            DEVSPI_Transmit_H((SPI_ModuleHandleTypeDef *)handle, &byte, 1, 1, 0x10);
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_SetPin(&devio->CS);
                }
            }
#endif    // DEVSPI_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVOWRE_SOFTWARE_ENABLED)
            DEVONEWIRE_Read((ONEWIRE_ModuleHandleTypeDef *)handle, &byte, 1);
#endif    // DEVOWRE_SOFTWARE_ENABLED
        }
    }
    return byte;
}
void DEVCMNI_WriteByte(uint8_t byte, uint8_t address) {
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = &DEV_getActDevCmniIo()[_actDev->cmni.numnow];
    void *handle = devcmni->modular;
    if(devcmni->protocol == I2C) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVI2C_SOFTWARE_ENABLED)
            DEVI2C_Transmit((I2C_ModuleHandleTypeDef *)handle, &byte, 1, address, 0, 0x10);
#endif    // DEVI2C_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVI2C_HARDWARE_ENABLED)
            DEVI2C_Transmit_H((I2C_ModuleHandleTypeDef *)handle, &byte, 1, address, 0, 0x10);
#endif    // DEVI2C_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVSPI_SOFTWARE_ENABLED)
            DEVSPI_Transmit((SPI_ModuleHandleTypeDef *)handle, &byte, 1, 0, 0x10);
#endif    // DEVSPI_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVSPI_HARDWARE_ENABLED)
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_ResetPin(&devio->CS);
                }
            }
            DEVSPI_Transmit_H((SPI_ModuleHandleTypeDef *)handle, &byte, 1, 0, 0x10);
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_SetPin(&devio->CS);
                }
            }
#endif    // DEVSPI_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVOWRE_SOFTWARE_ENABLED)
            DEVONEWIRE_Write((ONEWIRE_ModuleHandleTypeDef *)handle, &byte, 1, 0x10);
#endif    // DEVOWRE_SOFTWARE_ENABLED
        }
    }
}
bool DEVCMNI_Read(uint8_t *pdata, size_t size, size_t *length, uint8_t address) {
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = &DEV_getActDevCmniIo()[_actDev->cmni.numnow];
    void *handle = devcmni->modular;
    bool res = true;
    if(devcmni->protocol == I2C) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVI2C_SOFTWARE_ENABLED)
            res = !DEVI2C_Transmit((I2C_ModuleHandleTypeDef *)handle, pdata, size, address, 1, 0x10);
#endif    // DEVI2C_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVI2C_HARDWARE_ENABLED)
            res = !DEVI2C_Transmit_H((I2C_ModuleHandleTypeDef *)handle, pdata, size, address, 1, 0x10);
#endif    // DEVI2C_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVSPI_SOFTWARE_ENABLED)
            res = !DEVSPI_Transmit(((SPI_ModuleHandleTypeDef *)handle), pdata, size, 1, 0x10);
#endif    // DEVSPI_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVSPI_HARDWARE_ENABLED)
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_ResetPin(&devio->CS);
                }
            }
            res = !DEVSPI_Transmit_H(((SPI_ModuleHandleTypeDef *)handle), pdata, size, 1, 0x10);
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_SetPin(&devio->CS);
                }
            }
#endif    // DEVSPI_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVOWRE_SOFTWARE_ENABLED)
            res = !DEVONEWIRE_Read((ONEWIRE_ModuleHandleTypeDef *)handle, pdata, size);
#endif    // DEVOWRE_SOFTWARE_ENABLED
        }
    } else if(devcmni->protocol == USART) {
        if(devcmni->ware == HARDWARE) {
#if defined(DEVUART_HARDWARE_ENABLED)
            res = !DEVUART_Receive((UART_ModuleHandleTypeDef *)handle, pdata, size, length);
#endif    // DEVUART_HARDWARE_ENABLED
        }
    }
    return res;
}
bool DEVCMNI_Write(uint8_t *pdata, size_t size, uint8_t address) {
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = &DEV_getActDevCmniIo()[_actDev->cmni.numnow];
    void *handle = devcmni->modular;
    bool res = true;
    if(devcmni->protocol == I2C) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVI2C_SOFTWARE_ENABLED)
            res = !DEVI2C_Transmit((I2C_ModuleHandleTypeDef *)handle, pdata, size, address, 0, 0x10);
#endif    // DEVI2C_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVI2C_HARDWARE_ENABLED)
            res = !DEVI2C_Transmit_H((I2C_ModuleHandleTypeDef *)handle, pdata, size, address, 0, 0x10);
#endif    // DEVI2C_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == SPI) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVSPI_SOFTWARE_ENABLED)
            res = !DEVSPI_Transmit(((SPI_ModuleHandleTypeDef *)handle), pdata, size, 0, 0x10);
#endif    // DEVSPI_SOFTWARE_ENABLED
        } else if(devcmni->ware == HARDWARE) {
#if defined(DEVSPI_HARDWARE_ENABLED)
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_ResetPin(&devio->CS);
                }
            }
            res = !DEVSPI_Transmit_H(((SPI_ModuleHandleTypeDef *)handle), pdata, size, 0, 0x10);
            if(!((SPI_ModuleHandleTypeDef *)handle)->skip) {
                if(devio->CS.GPIOx != NULL) {
                    DEVIO_SetPin(&devio->CS);
                }
            }
#endif    // DEVSPI_HARDWARE_ENABLED
        }
    } else if(devcmni->protocol == ONEWIRE) {
        if(devcmni->ware == SOFTWARE) {
#if defined(DEVOWRE_SOFTWARE_ENABLED)
            res = !DEVONEWIRE_Write((ONEWIRE_ModuleHandleTypeDef *)handle, pdata, size, 0x10);
#endif    // DEVOWRE_SOFTWARE_ENABLED
        }
    } else if(devcmni->protocol == USART) {
        if(devcmni->ware == HARDWARE) {
#if defined(DEVUART_HARDWARE_ENABLED)
            res = !DEVUART_Transmit((UART_ModuleHandleTypeDef *)handle, pdata, size);
#endif    // DEVUART_HARDWARE_ENABLED
        }
    }
    return res;
}


