VanillaCo1a/Single-phase_AC_electronic_load/Firmware/STM32_Ctrl/CodeMultiPlatform/device/device.c
/////////////////////////    设备构造&错误处理部分    /////////////////////////
/**
 * @description:
 * @param {int8_t} err
 * @return {*}
 */
void DEV_Error(uint16_t err) {
    DEVS_TypeDef *actdevs = DEV_getActDevs();
    DEV_TypeDef *actdev = DEV_getActDev();
    poolsize stream = actdevs->stream;
    //todo: SYSTEM_errorprintf();
    // extern DEVS_TypeDef oleds;
    // DEV_setActStream(&oleds, 0);
    // if(DEV_GetActState() == idle) {
    //     OLED_clearBuffer();
    //     OLED_Num(2, 8 * 10 + 0, err ^ (actdevs->type << 8), 4);
    //     OLED_updateScreen();
    // }
    // DEV_setActStream(actdevs, stream);
    if(err == DEVIO_NOFOUND) {
        return;
    } else if(err < 10) {
        while(1)
            ;
    } else if(err >= 0x0100) {
        DEV_setActStream(actdevs, stream);
        actdev->error = 1;
    }
}
void DEV_ioConfigur(void) {
    if(_actDev->io.init != NULL) {
        _actDev->io.init();
    }
}
void DEV_ioInit(void) {
    for(poolsize i = sizeof(DEVCMNIIO_TypeDef) / sizeof(DEVIO_TypeDef); i < DEV_getActDev()->io.num; i++) {
        if(DEVIO_isNull(&DEV_getActDevIo()[i])) {
            DEV_Error(DEVIO_NOFOUND);
            continue;
        }
        DEVIO_Init(&DEV_getActDevIo()[i]);
    }
}

// #define DEVCMNI_MAXNUM     20     //设备总线数量
// static poolsize _bussize = 0;
// static DEVS_TypeDef _bus = {.type = CMNIBUS};
// static DEV_TypeDef _buspool[DEVCMNI_MAXNUM] = {0};
// /**
//  * @description: 从总线池中分配空间保存总线数组, 并将序号更新至总线变量中
//  * @param {DEV_TypeDef} dev
//  * @param {poolsize} num
//  * @return {*}
//  */
// bool BUSPOOL_Init(DEV_TypeDef dev[], poolsize num) {
//     if(_bussize + num >= DEVCMNI_MAXNUM) {
//         return true;    //申请失败
//     }
//     for(poolsize i = 0; i < num; i++) {
//         _buspool[_bussize + i] = dev[i];
//     }
//     _bussize += num;
//     return false;
// }
void DEV_cmniConfigur(void) {
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = DEV_getActDevCmniIo();
    // poolsize num = 0;
    for(poolsize i = 0; i < DEV_getActDev()->cmni.num; i++) {
        if(DEVCMNI_isNull(&devcmni[i]) || DEVCMNIBUS_isNull(&devcmni[i])) {    //检查通信配置有效性
            DEV_Error(DEVCMNI_NOFOUND);
            devcmni[i].bus = NULL;
            continue;
        }
        if(DEVCMNIIO_isNull(&devcmni[i], &devio[i])) {    //检查通信IO有效性
            DEV_Error(DEVCMNIIO_NOFOUND);
            devcmni[i].bus = NULL;
            continue;
        }
        // DEV_TypeDef bus = {.io = {.num = sizeof(DEVCMNIIO_TypeDef) / sizeof(DEVIO_TypeDef), .confi = DEV_getActDevIo()},
        //                    .cmni = {.num = 1, .confi = devcmni[i].bus}};
        // if(BUSPOOL_Init(&bus, 1)) {
        //     DEV_Error(DEV_POOLFULL);
        // }
        DEVCMNI_BusInit(&devcmni[i]);
        // num++;
    }
    // if(DEVPOOL_init(&_bus, &_buspool[_bussize], num)) {
    //     DEV_Error(DEV_POOLFULL);
    // }
}
void DEV_cmniInit(void) {
    DEVCMNI_TypeDef *devcmni = DEV_getActDevCmni();
    DEVCMNIIO_TypeDef *devio = DEV_getActDevCmniIo();
    for(poolsize i = 0; i < DEV_getActDev()->cmni.num; i++) {
        if(DEVCMNI_isNull(&devcmni[i]) || DEVCMNIBUS_isNull(&devcmni[i])) {    //检查通信配置有效性
            DEV_Error(DEVCMNI_NOFOUND);
            devcmni[i].bus = NULL;
            continue;
        }
        if(DEVCMNIIO_isNull(&devcmni[i], &devio[i])) {    //检查通信IO有效性
            DEV_Error(DEVCMNIIO_NOFOUND);
            devcmni[i].bus = NULL;
            continue;
        }
        DEVCMNI_Init(&devcmni[i], &devio[i]);
    }
}
void DEV_Init(DEVS_TypeDef *devs, DEV_TypeDef dev[], poolsize num) {
    if(DEVS_isNull(devs, dev)) {
        DEV_Error(DEV_NOFOUND);
    }
    if(DEVPOOL_init(devs, dev, num)) {    //初始化一类设备实例到设备池中
        DEV_Error(DEV_POOLFULL);
    }
    DEV_doAction(devs, DEV_ioConfigur);
    DEV_doAction(devs, DEV_cmniConfigur);
    DEV_doAction(devs, DEV_ioInit);      //设备IO初始化
    DEV_doAction(devs, DEV_cmniInit);    //设备通信初始化
}
